# pandas - part5 - DataFrameのソート - Exercise

---

In [ ]:
!wget https://gist.githubusercontent.com/murayama333/bb6e828389735f1fad0c2bc339d3f441/raw/9981807fc80526faa01e6185845363e137c0d9be/staffs.csv

In [3]:
import pandas as pd
pd.options.display.precision = 2
pd.options.display.float_format = '{:.2f}'.format

staffs = pd.read_csv("staffs.csv", index_col=0)
staffs

      name  age  sal       job
id
1     Andy   27  650     sales
2    Betty   28  800  engineer
3   Charol   28  700  designer
4   Daniel   22  650  marketer
5    Ellen   24  700     sales
6    Flora   30  750  engineer
7   George   24  500  designer
8    Holly   32  650  engineer
9      Ian   32  700   manager

## 5.1 age の昇順で出力してください。

      name  age  sal       job
id
4   Daniel   22  650  marketer
5    Ellen   24  700     sales
7   George   24  500  designer
1     Andy   27  650     sales
2    Betty   28  800  engineer
3   Charol   28  700  designer
6    Flora   30  750  engineer
8    Holly   32  650  engineer
9      Ian   32  700   manager

## 5.2 sal の降順で出力してください。

      name  age  sal       job
id
2    Betty   28  800  engineer
6    Flora   30  750  engineer
3   Charol   28  700  designer
5    Ellen   24  700     sales
9      Ian   32  700   manager
1     Andy   27  650     sales
4   Daniel   22  650  marketer
8    Holly   32  650  engineer
7   George   24  500  designer

## 5.3 job の昇順、sal の降順で出力してください。

      name  age  sal       job
id
3   Charol   28  700  designer
7   George   24  500  designer
2    Betty   28  800  engineer
6    Flora   30  750  engineer
8    Holly   32  650  engineer
9      Ian   32  700   manager
4   Daniel   22  650  marketer
5    Ellen   24  700     sales
1     Andy   27  650     sales

# pandas - part6 - DataFrameのグループ化 - Exercise

---

In [7]:
import pandas as pd
pd.options.display.precision = 2
pd.options.display.float_format = '{:.2f}'.format

staffs = pd.read_csv("staffs.csv", index_col=0)
staffs

      name  age  sal       job
id
1     Andy   27  650     sales
2    Betty   28  800  engineer
3   Charol   28  700  designer
4   Daniel   22  650  marketer
5    Ellen   24  700     sales
6    Flora   30  750  engineer
7   George   24  500  designer
8    Holly   32  650  engineer
9      Ian   32  700   manager

## 6.1 job でグループ化して age sal の平均値を出力してください。

           age    sal
job
designer 26.00 600.00
engineer 30.00 733.33
manager  32.00 700.00
marketer 22.00 650.00
sales    25.50 675.00

## 6.2 age でグループ化して sal の平均値を出力してください。

     sal
age
22   650
24   600
27   650
28   750
30   750
32   675

## 6.3 age を20代、30代でグループ化して sal の平均値を出力してください。

            sal
age_group
20         4000
30         2100

## 6.4 Pivotテーブルによって age_group, age をインデックスとして sal を出力してください。

               sal
age_group age
20        22   650
          24   700
          24   500
          27   650
          28   800
          28   700
30        30   750
          32   650
          32   700

## 6.5 Pivotテーブルによって age をインデックス、カラムに sal を指定して age を出力してください。

         sal
job designer engineer manager marketer  sales
age
22       nan      nan     nan   650.00    nan
24    500.00      nan     nan      nan 700.00
27       nan      nan     nan      nan 650.00
28    700.00   800.00     nan      nan    nan
30       nan   750.00     nan      nan    nan
32       nan   650.00  700.00      nan    nan

# pandas - part7 - DataFrameの結合 - Exercise

---

In [ ]:
!wget https://gist.githubusercontent.com/murayama333/ea9aedf998d73c2367044ae295e48e9c/raw/3bad253e0f7bb9987d2fdc0f9051f4acaa6d9eec/staffs2.csv

In [ ]:
!wget https://gist.githubusercontent.com/murayama333/328c72b8c2d0c6cf26b765e227e63756/raw/fd251b7c37e3574e458443a93cd5bb00dd09e12d/jobs.csv

In [18]:
import pandas as pd
pd.options.display.precision = 2
pd.options.display.float_format = '{:.2f}'.format

staffs = pd.read_csv("staffs2.csv", index_col=0)
staffs

      name  age  sal  job_id
id
1     Andy   27  650       1
2    Betty   28  800       2
3   Charol   28  700       3
4   Daniel   22  650       4
5    Ellen   24  700       1
6    Flora   30  750       2
7   George   24  500       3
8    Holly   32  650       2
9      Ian   32  700       5

In [19]:
jobs = pd.read_csv("jobs.csv", index_col=0)
jobs

        name
id
1      sales
2   engineer
3   designer
4   marketer

## 7.1 staffs と jobs を左外部結合して出力してください。

      name  age  sal  job_id name_jobs
id
1     Andy   27  650       1     sales
2    Betty   28  800       2  engineer
3   Charol   28  700       3  designer
4   Daniel   22  650       4  marketer
5    Ellen   24  700       1     sales
6    Flora   30  750       2  engineer
7   George   24  500       3  designer
8    Holly   32  650       2  engineer
9      Ian   32  700       5       NaN

## 7.2 staffs と jobs を内部結合して出力してください。

      name  age  sal  job_id name_jobs
id
1     Andy   27  650       1     sales
2    Betty   28  800       2  engineer
3   Charol   28  700       3  designer
4   Daniel   22  650       4  marketer
5    Ellen   24  700       1     sales
6    Flora   30  750       2  engineer
7   George   24  500       3  designer
8    Holly   32  650       2  engineer

## 7.3 staffs と jobs を内部結合し、name_jobs でグループ化して sa lの平均値を出力してください。

             sal
name_jobs
designer  600.00
engineer  733.33
marketer  650.00
sales     675.00

# pandas - part8 - 欠損値の補完 - Exercise

---

In [ ]:
!wget https://gist.githubusercontent.com/murayama333/9adfdf22c897fc818a0e4c845e8cb7cd/raw/5daa5ad4fe36a77df11e8f439543d8f2c60a4fee/staffs3.csv

In [25]:
import pandas as pd
pd.options.display.precision = 2
pd.options.display.float_format = '{:.2f}'.format

staffs = pd.read_csv("staffs3.csv", index_col=0)

staffs

      name  age    sal  job_id
id
1     Andy   27 650.00       1
2    Betty   28 800.00       2
3   Charol   28 700.00       3
4   Daniel   22 650.00       4
5    Ellen   24    nan       1
6    Flora   30 750.00       2
7   George   24 500.00       3
8    Holly   32    nan       2
9      Ian   32 700.00       5

## 8.1 欠損値を含むレコードを削除して結果を出力してください。

      name  age    sal  job_id
id
1     Andy   27 650.00       1
2    Betty   28 800.00       2
3   Charol   28 700.00       3
4   Daniel   22 650.00       4
6    Flora   30 750.00       2
7   George   24 500.00       3
9      Ian   32 700.00       5

## 8.2 欠損値を平均値で補完して結果を出力してください。

      name  age    sal  job_id
id
1     Andy   27 650.00       1
2    Betty   28 800.00       2
3   Charol   28 700.00       3
4   Daniel   22 650.00       4
5    Ellen   24 678.57       1
6    Flora   30 750.00       2
7   George   24 500.00       3
8    Holly   32 678.57       2
9      Ian   32 700.00       5

## 8.3 欠損値を一つ前のレコードから補完して結果を出力してください。

      name  age    sal  job_id
id
1     Andy   27 650.00       1
2    Betty   28 800.00       2
3   Charol   28 700.00       3
4   Daniel   22 650.00       4
5    Ellen   24 650.00       1
6    Flora   30 750.00       2
7   George   24 500.00       3
8    Holly   32 500.00       2
9      Ian   32 700.00       5

## 8.4 欠損値を job_id ごとの平均値で補完して結果を出力してください。

      name  age    sal  job_id
id
1     Andy   27 650.00       1
2    Betty   28 800.00       2
3   Charol   28 700.00       3
4   Daniel   22 650.00       4
5    Ellen   24 650.00       1
6    Flora   30 750.00       2
7   George   24 500.00       3
8    Holly   32 775.00       2
9      Ian   32 700.00       5